public_html/健康码扫码？多此一举.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2022-04-24 Sun 14:31 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>健康码扫码？多此一举</title>
<meta name="author" content="Felix M. Tang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="./style.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<header>
  <nav>
    <a href="./index.html">Home</a>
    <a href="./theindex.html">Articles</a>
    <a href="./about.html">About</a>
  </nav>
</header>
<hr/>
</div>
<div id="content" class="content">
<h1 class="title">健康码扫码？多此一举</h1>
<p>
杭州的主要场合健康码从安保人员肉眼看，到需要扫描现场的二维码，过程类似扫码签到。每次挤着一堆人在那里对着一个二维码扫要扫就莫名急躁。
</p>

<p>
幸好咱是专业的。借助苹果 Shortcuts 实现了不扫描二维码也照样签到，在不违反政策的情况下实现了最懒的方案。
</p>

<p>
最终效果是启动 Shortcut 在事先列出的场所中选取即可方便得转到支付宝健康码页面，并显示以扫码。Shortcut 制作过程如下
</p>

<div id="outline-container-orgdd77fe8" class="outline-2">
<h2 id="orgdd77fe8"><span class="section-number-2">1.</span> 解析我主要去的几个场所的二维码信息</h2>
<div class="outline-text-2" id="text-1">
<p>
例如某地点的二维码信息是如下字符串
</p>

<p>
<code>alipays://platformapi/startapp?appId=2021002175684865&amp;page=pages%2Findex%2Findex&amp;nbupdate=syncforce&amp;query=communityCode%3D3301910910141468427002530312197%26communityName%3D%E6%B2%88%E5%A1%98%E6%A1%A5%E7%AB%99</code>
</p>

<p>
这是苹果所谓的 URL Scheme，可以发现如果在 iOS 上点击此链接即可自动跳转到相应支付宝健康码页面，并显示以扫码。接下来就很简单，将常用几个地点的 URL Scheme 列出，需要哪个就点哪个就好了。
</p>
</div>
</div>

<div id="outline-container-orgd52a50e" class="outline-2">
<h2 id="orgd52a50e"><span class="section-number-2">2.</span> 捷径</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org277f67b" class="outline-3">
<h3 id="org277f67b"><span class="section-number-3">2.1.</span> 菜单</h3>
</div>
<div id="outline-container-orgf4cdf4e" class="outline-3">
<h3 id="orgf4cdf4e"><span class="section-number-3">2.2.</span> Safari 打开 URL Scheme</h3>
</div>
<div id="outline-container-orgdc536ef" class="outline-3">
<h3 id="orgdc536ef"><span class="section-number-3">2.3.</span> 即可自动跳转到支付宝健康码</h3>
</div>
<div id="outline-container-orge97da54" class="outline-3">
<h3 id="orge97da54"><span class="section-number-3">2.4.</span> 捷径分享</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<a href="https://www.icloud.com/shortcuts/c1bc392785a64c778d9d55d9d59352e8">https://www.icloud.com/shortcuts/c1bc392785a64c778d9d55d9d59352e8</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
  <div class="copyright-container">
    <div class="copyright">
      版权所有 &copy; 2022 汤美法
    </div>
  </div>
  <div class="generated">
    使用 <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.0.50 (<a href="https://orgmode.org">Org</a> mode 9.5.2) 构建</a>
  </div>
</footer>
</div>
</body>
</html>
